# Lab1: Select Statement

SELECT Title, ProductionCompany, Locations, ReleaseYear FROM FilmLocations WHERE Writer = "James Cameron";

# Lab2: Count, Distinct, LIMIT

FilmLocations(
Title:              titles of the films, 
ReleaseYear:        time of public release of the films, 
Locations:          locations of San Francisco where the films were shot, 
FunFacts:           funny facts about the filming locations, 
ProductionCompany:  companies who produced the films, 
Distributor:        companies who distributed the films, 
Director:           people who directed the films, 
Writer:             people who wrote the films, 
Actor1:             person 1 who acted in the films, 
Actor2:             person 2 who acted in the films,
Actor3:             person 3 who acted in the films
)

#COUNT ALL
SELECT COUNT(*) FROM FilmLocations; 

#count the number of locations of the films that writer = james Cameron
SELECT COUNT(Locations) FROM FilmLocations WHERE Writer="James Cameron";

#Distinct = duplicates will be discarded 
SELECT DISTINCT Title FROM FilmLocations;

#Retrieve only the first 25 rows from the table
SELECT * FROM FilmLocations LIMIT 25;


#retrieve 15 rows from the table starting from row 11.
SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;

#LIMIT
SELECT DISTINCT Title FROM FilmLocations LIMIT 50;
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 3 OFFSET 5;

#How does the syntax of an INSERT statement look?
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... );

#How does the syntax of an UPDATE statement look?
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;


#How does the syntax of a DELETE statement look?
DELETE FROM table_name
WHERE condition;

# INSERT
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(7, 'Cangiano', 'Antonio', 'Vancouver', 'CA');

SELECT * FROM Instructor;
2. UPDATE
UPDATE Instructor 
SET city='Toronto' 
WHERE firstname="Sandip";

UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5;